# -*- coding: utf-8 -*-

def project_data():
    dic = {
        "プロジェクト名":"シマノライン2",
        "NASベースパス":r"\\192.168.10.74\b-lex-data-folder\100_Project\Warm-Up\山本精密",
        "データ構成":{
            "JPN111107":{
                "機械名呼称":"ID241_M140X2_ブラザー",
                "機械接続情報":{
                    "CNC種類":"ブラザー",
                    "機械IP":"128.81.2.5",
                    "マクロ監視開始番号":740,
                    },
                "デバイス":{
                    "b-lex":{
                        "0069":{
                            "デバイス名呼称":"b-lex_0069",
                            "ポート番号":12,
                            },
                        },
                    },
                },
            "NV502111234":{
                "機械名呼称":"ID193_NVX5100_DMG",
                "機械接続情報":{
                    "CNC種類":"三菱",
                    "RS232Cポート番号":10,
                    "conprosysIP":"10.1.1.101",
                    },
                "デバイス":{
                    "b-lex":{
                        "0052":{
                            "デバイス名呼称":"b-lex_0052",
                            "ポート番号":11,
                            },
                        },
                    },
                },
            },
        }
    return dic